In [2]:
import pandas as pd

date = {
    "name": ["Anna", "Jan", "Maria", "Tomasz", "Katarzyna"],
    "surname": ["Kowalska", "Nowak", "Wiśniewska", "Kaczmarek", "Zielińska"],
    "age": [28, 35, 42, 19, 30],
    "city": ["Warszawa", "Kraków", "Poznań", "Wrocław", "Gdańsk"],
    "income": [5000, 6200, 7100, 3200, 4600]
}

df = pd.DataFrame(date)
df.to_csv("date.csv", index=False)

### Wczytaj plik CSV o nazwie dane.csv i wyświetl pierwsze 5 wierszy.

In [3]:
file = pd.read_csv("date.csv")
df = pd.DataFrame(file)
print(df.head(5))

        name     surname  age      city  income
0       Anna    Kowalska   28  Warszawa    5000
1        Jan       Nowak   35    Kraków    6200
2      Maria  Wiśniewska   42    Poznań    7100
3     Tomasz   Kaczmarek   19   Wrocław    3200
4  Katarzyna   Zielińska   30    Gdańsk    4600

### Wyświetl podstawowe statystyki opisowe (średnia, mediana, min, max itd.) dla danych.

In [4]:
df.describe()

             age       income
count   5.000000     5.000000
mean   30.800000  5220.000000
std     8.526429  1500.666519
min    19.000000  3200.000000
25%    28.000000  4600.000000
50%    30.000000  5000.000000
75%    35.000000  6200.000000
max    42.000000  7100.000000

### Wyświetl informacje o kolumnach i typach danych (np. za pomocą .info()).

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     5 non-null      object
 1   surname  5 non-null      object
 2   age      5 non-null      int64
 3   city     5 non-null      object
 4   income   5 non-null      int64
dtypes: int64(2), object(3)
memory usage: 332.0+ bytes

### Wyświetl wszystkie wiersze, w których wartość w kolumnie wiek jest większa niż 30.

In [7]:
ageMorethan30 = df[df['age']>30]
print(ageMorethan30)

    name     surname  age    city  income
1    Jan       Nowak   35  Kraków    6200
2  Maria  Wiśniewska   42  Poznań    7100

### Wyświetl wszystkie wiersze, w których wartość w kolumnie wiek jest większa niż 30.

### Dodaj nową kolumnę rok_urodzenia, zakładając że obecny rok to 2025 i korzystając z kolumny wiek.

In [8]:
df['rok_urodzenia'] = 2025 - df['age']

### Oblicz średnią wartość kolumny dochód.

In [9]:
df.income.mean()

5220.0

### Zgrupuj dane po kolumnie miasto i policz średni wiek w każdej grupie.

In [10]:
df.groupby('city')['age'].mean()

city
Gdańsk      30.0
Kraków      35.0
Poznań      42.0
Warszawa    28.0
Wrocław     19.0
Name: age, dtype: float64

### Zapisz przetworzone dane do nowego pliku CSV o nazwie nowe_dane.csv.

In [11]:
df.to_csv("new_date.csv", index=False)

### Usuń wszystkie wiersze zawierające brakujące wartości (NaN).

In [12]:
df.dropna()

        name     surname  age      city  income  rok_urodzenia
0       Anna    Kowalska   28  Warszawa    5000           1997
1        Jan       Nowak   35    Kraków    6200           1990
2      Maria  Wiśniewska   42    Poznań    7100           1983
3     Tomasz   Kaczmarek   19   Wrocław    3200           2006
4  Katarzyna   Zielińska   30    Gdańsk    4600           1995